#!/bin/bash

python main.py \
    --query_path "/root/ai_curri/input_data/test/test_expand_random.json"   \
    --expand yes    \
    --dept no

# python main_one.py \
#     --query "글로벌 무역 데이터를 학습하여 국가별 무역 정책을 분석하고, 기업의 시장 진출 전략을 지원하는 LLM(대규모 언어 모델)을 개발하고 싶어요. 이를 위해 필요한 인공지능 및 데이터 처리 기술, 학습 과정, 연구 방향에는 어떤 것들이 있을까요?"   \
#     --dept no  \
#     --expanded_query "글로벌 무역 데이터를 학습하여 국가별 무역 정책을 분석하고, 기업의 시장 진출 전략을 지원하는 LLM(대규모 언어 모델)을 개발하고 싶어요. LLM(대규모 언어 모델) 개발 기술 습득 인공지능과 데이터 분석을 활용한 무역 및 시장 전략 지원 인공지능 및 데이터 분석 AI 모델 개발자 대규모 언어 모델(LLM)을 설계 및 개발하여 다양한 국가의 무역 데이터를 분석하고 기업의 시장 진출 전략을 지원하는 역할을 수행함. 무역 데이터 분석을 위한 AI 모델 설계, LLM 훈련 및 최적화, 시장 진출 전략 관련 데이터 처리 인공지능, 데이터 처리, 머신러닝 모델 개발 자연어 처리, 딥러닝, 데이터 시각화, 소프트웨어 개발 인공지능 기초, 머신러닝 알고리즘, 데이터베이스 관리 자연어 처리, 대규모 언어 모델 구조, 무역 정책 분석 데이터 전처리 및 클리닝, 파이썬 및 관련 라이브러리 사용, 데이터 시각화 및 보고서 작성"  \